w21d3/w21d3_student_labs/playlists_app/playlists_app_api/app/controllers/playlists_songs_controller.rb

SELECT "playlists_songs".* FROM "playlists_songs"
---
  def index
    @playlists_songs = PlaylistsSong.all

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_playlists_song
      @playlists_song = PlaylistsSong.find(params[:id])