w21d3/w21d3_student_labs/playlists_app/playlists_app_api/app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
  def index
    @playlists = Playlist.all

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_playlist
      @playlist = Playlist.find(params[:id])