w21d3/w21d3_student_labs/playlists_app/playlists_app_api/app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

    def set_song
      @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]