w20d3/w20d3_student_examples/noticeboard_app/noticeboard_api/app/controllers/notices_controller.rb

SELECT "notices".* FROM "notices"
---
  def index
    @notices = Notice.all

INSERT INTO "notices" ("title", "author", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Do or do not there is no try"], ["author", "Yoda"], ["phone", "555-555-5555"], ["created_at", "2020-04-30 00:25:29.125235"], ["updated_at", "2020-04-30 00:25:29.125235"]]
---
  def create
    @notice = Notice.new(notice_params)

    if @notice.save

UPDATE "notices" SET "author" = $1, "updated_at" = $2 WHERE "notices"."id" = $3  [["author", "Mon Mothma2"], ["updated_at", "2020-05-02 13:33:44.431542"], ["id", 2]]
---
  def update
    if @notice.update(notice_params)

DELETE FROM "notices" WHERE "notices"."id" = $1  [["id", 101]]
---
  def destroy
    @notice.destroy

SELECT "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_notice
      @notice = Notice.find(params[:id])