w20d1/w20d1_student_labs/books_app_api/app/controllers/books_controller.rb

    def show
        book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def preview
        book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def create
        book = Book.new(book_params)
        if book.save
---
INSERT INTO "books" ("title", "author", "genre", "publisher", "publish_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        book = Book.find(params[:id])
        book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 102], ["LIMIT", 1]]
UPDATE "books" SET "genre" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["genre", "Non-Fiction"], ["updated_at", "2020-04-25 19:23:08.737302"], ["id", 102]]

    def destroy
        book = Book.destroy(params[:id])
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 103]]