w21d1/w21d1_student_examples/temperatures/temperatures_api/app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    #to show params hash puts params in any route
    # puts "=========================="
    # puts params
    # puts "=========================="

    @location = Location.find(params[:id])