w21d1/w21d1_student_examples/temperatures/temperatures_api/app/controllers/temperatures_controller.rb

SELECT "temperatures".* FROM "temperatures"
---
  def index
    @temperatures = Temperature.all

INSERT INTO "temperatures" ("average_high_f", "average_low_f", "month", "created_at", "updated_at", "location_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["average_high_f", -8], ["average_low_f", -13], ["month", "February"], ["created_at", "2020-05-02 16:18:54.865082"], ["updated_at", "2020-05-02 16:18:54.865082"], ["location_id", 2]]
---
  def create
    @temperature = Temperature.new(temperature_params)
    @temperature.location_id = params[:location_id]

    if @temperature.save