w21d1/w21d1_student_labs/stocks/stocks_api/app/controllers/prices_controller.rb

SELECT "prices".* FROM "prices"
---
  def index
    @prices = Price.all

INSERT INTO "prices" ("avg_price", "created_at", "updated_at", "stock_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["avg_price", "800.0"], ["created_at", "2020-05-02 18:33:22.521272"], ["updated_at", "2020-05-02 18:33:22.521272"], ["stock_id", 1]]
---
  def create
    @price = Price.new(price_params)
    @price.stock_id = params[:stock_id]
    if @price.save