w20d1/w20d1_student_examples/songs_app_api/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        #in javascript it was req.params.id instead of params[:id]
        # render json: Song.find(params[:id])
        song = Song.find(params[:id])