w20d1/w20d1_student_examples/songs_app_api/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        #long form syntax to connect directly into the database through ActiveRecord so you can issue SQL commands
        # render json: ActiveRecord::Base.connection.execute('SELECT * FROM songs;')

        # shorter syntax to use Object Relation Mapper
        # render json: Song.all

        #If we are going to deliver our API to some end-user, we should provide a status code.
        #Change the code to deliver a 200 OK status code:
        songs = Song.all

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
        #in javascript it was req.params.id instead of params[:id]
        # render json: Song.find(params[:id])
        #to view params that are provided
        puts params
        #Deliver status code with response
        song = Song.find(params[:id])

INSERT INTO "songs" ("title", "artist_name", "artwork") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Sunshine Daydream"], ["artist_name", "Grateful Dead"], ["artwork", "None"]]
---
    def create
        #creates a new song but uses strong params through song_params to validate the data
        song = Song.new(song_params)

        if song.save

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "artist_name" = $2 WHERE "songs"."id" = $3  [["title", "Friend of the Devil"], ["artist_name", "The Dead"], ["id", 13]]
---
    def update
        song = Song.find(params[:id])
        song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 12]]
---
    def destroy
        song = Song.destroy(params[:id])